Revit 2024 API
PanelScheduleTemplate.GetTableData Method
 Gets the writable table data object.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PanelScheduleData GetTableData()
Visual Basic
Public Function GetTableData As PanelScheduleData
Visual C++
public:
PanelScheduleData^ GetTableData()
Return Value
 The panel schedule data object.
Remarks
 Access to this information requires an open transaction.
See Also
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace